// Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

/*Console.Write("Input first number:  ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input second number:  ");
int num2 = Convert.ToInt32(Console.ReadLine());

if (num1 > num2)
{
    Console.Write("max = "+ num1);
}
else
{
    Console.Write("max = " + num2);
}
*/

//Задача 2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

/*Console.Write("Input first number: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input second number: ");
int num2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input third number: ");
int num3 = Convert.ToInt32(Console.ReadLine());

int max = num1;
if (num2 > max)
{
    int max = num2;
}  
else 
{
    int max = num1;
}
 if (num3 > max)
 { 
    int max = num3;
    Console.Write("max = " + max);
 }
 else 
 {
    Console.Write("max = " + max);
 }*/

 //Задача 3: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

/*Console.Write("Input number:  ");
int num = Convert.ToInt32(Console.ReadLine());

if (num % 2 == 0)
{
    Console.Write("Yes");
}
else
{
    Console.Write("No");
}
*/

//Задача 4: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

/*Console.Write("Input number:  ");
int num = Convert.ToInt32(Console.ReadLine());

int current = 2;

while(current <=num)
{
    Console.Write(current + " ");
    current +=2;
}
*/